rails/planit/app/controllers/home_controller.rb

SELECT "categories".* FROM "categories"
SELECT "providers".* FROM "providers"
---
  def index
    @providers = []
    @categories = Category.all
    if params[:category]
      @providers = (Provider.all).select { |prov| prov.category_id == params[:category].to_i }